Tekla Open API Reference for Tekla Structures 2025
CastUnitDrawing.CastUnitById Property
 Cast unit definition method. True means the cast unit definition method is by cast unit id. False means the cast unit definition method is by cast unit position.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CastUnitById { get; }
Public ReadOnly Property CastUnitById As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CastUnitDrawing Class
Tekla.Structures.Drawing Namespace